### Importing the Packages

In [1]:
import pandas as pd
import numpy as np

### Importing the data

In [2]:
raw_csv_data = pd.read_csv("Index2018.csv") 
data=raw_csv_data.copy()

### Length of the Time Period

In [3]:
data.date.describe()

count           6269
unique          6269
top       07/01/1994
freq               1
Name: date, dtype: object

### From Text to Date

In [4]:
pd.to_datetime(data.date,dayfirst=True)

0      1994-01-07
1      1994-01-10
2      1994-01-11
3      1994-01-12
4      1994-01-13
          ...
6264   2018-01-23
6265   2018-01-24
6266   2018-01-25
6267   2018-01-26
6268   2018-01-29
Name: date, Length: 6269, dtype: datetime64[ns]

In [5]:
data.date=pd.to_datetime(data.date,dayfirst=True)

In [6]:
data.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [7]:
data.date.describe()

/var/folders/ws/jfyqgcz57_374tjld1g6w96m0000gn/T/ipykernel_60464/3984613233.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  data.date.describe()

count                    6269
unique                   6269
top       1994-01-07 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

### Setting the Index

In [8]:
data.set_index('date',inplace=True)
data

                    spx       dax         ftse    nikkei
date
1994-01-07   469.900000   2224.95  3445.980000  18124.01
1994-01-10   475.270000   2225.00  3440.580000  18443.44
1994-01-11   474.130000   2228.10  3413.770000  18485.25
1994-01-12   474.170000   2182.06  3372.020000  18793.88
1994-01-13   472.470000   2142.37  3360.010000  18577.26
...                 ...       ...          ...       ...
2018-01-23  2839.130362  13559.60  7731.827774  24124.15
2018-01-24  2837.544008  13414.74  7643.428966  23940.78
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

[6269 rows x 4 columns]

### Setting the Desired Frequency

- We need to assign frequency of dataset to turn it into time series
- Pandas as asfreq method. One argument is taken, 'h','d','w','m','a' for hour, day, week, month, annual respectively
- We can directly call the dataframe and pass the argument as needed, the function will automatically enter any missing dates.

In [9]:
data.asfreq('D')

                    spx       dax         ftse    nikkei
date
1994-01-07   469.900000   2224.95  3445.980000  18124.01
1994-01-08          NaN       NaN          NaN       NaN
1994-01-09          NaN       NaN          NaN       NaN
1994-01-10   475.270000   2225.00  3440.580000  18443.44
1994-01-11   474.130000   2228.10  3413.770000  18485.25
...                 ...       ...          ...       ...
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-27          NaN       NaN          NaN       NaN
2018-01-28          NaN       NaN          NaN       NaN
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

[8789 rows x 4 columns]

- Here the missing dates are entered. Sometimes we dont need to analyze data on weekends so we want to remove weekends from the time series. for that we can pass 'b' in arguments, it will only take the business days.

In [10]:
data.asfreq('b')

                    spx       dax         ftse    nikkei
date
1994-01-07   469.900000   2224.95  3445.980000  18124.01
1994-01-10   475.270000   2225.00  3440.580000  18443.44
1994-01-11   474.130000   2228.10  3413.770000  18485.25
1994-01-12   474.170000   2182.06  3372.020000  18793.88
1994-01-13   472.470000   2142.37  3360.010000  18577.26
...                 ...       ...          ...       ...
2018-01-23  2839.130362  13559.60  7731.827774  24124.15
2018-01-24  2837.544008  13414.74  7643.428966  23940.78
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

[6277 rows x 4 columns]

In [11]:
data=data.asfreq('b')

### Handling Missing Values

In [12]:
data.isna()

              spx    dax   ftse  nikkei
date
1994-01-07  False  False  False   False
1994-01-10  False  False  False   False
1994-01-11  False  False  False   False
1994-01-12  False  False  False   False
1994-01-13  False  False  False   False
...           ...    ...    ...     ...
2018-01-23  False  False  False   False
2018-01-24  False  False  False   False
2018-01-25  False  False  False   False
2018-01-26  False  False  False   False
2018-01-29  False  False  False   False

[6277 rows x 4 columns]

In [13]:
data.isna().sum()  #there are 8 missing values

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [ ]:
#fillna(): it fills missing values in various ways.
# front filling: fills in data from previous period
# back filling: fills in data from next period
# assign same value: assign average value (not suggested in time series)

In [15]:
data['spx']=data['spx'].fillna(method='ffill')

In [16]:
data['ftse']=data['ftse'].fillna(method='bfill')

In [17]:
data['dax']=data['dax'].fillna(value=data.dax.mean())

In [18]:
data['nikkei']=data['nikkei'].fillna(method='ffill')
data.isna().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

### Simplifying the Dataset

In [20]:
#here we will be analyzing sap500 thus removing other cols
#create a new col with same values as sap
data['market_val']=data.spx
data.head()

               spx      dax     ftse    nikkei  market_val
date
1994-01-07  469.90  2224.95  3445.98  18124.01      469.90
1994-01-10  475.27  2225.00  3440.58  18443.44      475.27
1994-01-11  474.13  2228.10  3413.77  18485.25      474.13
1994-01-12  474.17  2182.06  3372.02  18793.88      474.17
1994-01-13  472.47  2142.37  3360.01  18577.26      472.47

In [21]:
data_spx=data.copy()

In [24]:
del data_spx['spx']
del data_spx['dax']
del data_spx['ftse']
del data_spx['nikkei']

In [25]:
data_spx

             market_val
date
1994-01-07   469.900000
1994-01-10   475.270000
1994-01-11   474.130000
1994-01-12   474.170000
1994-01-13   472.470000
...                 ...
2018-01-23  2839.130362
2018-01-24  2837.544008
2018-01-25  2839.253031
2018-01-26  2872.867839
2018-01-29  2853.528411

[6277 rows x 1 columns]

### Splitting the Data

In [34]:
size=int(data_spx.shape[0]*0.8)

In [35]:
spx_train=data_spx.iloc[:size]
spx_test=data_spx.iloc[size:]

In [36]:
spx_train.tail()

             market_val
date
2013-04-01  1562.173837
2013-04-02  1570.252238
2013-04-03  1553.686978
2013-04-04  1559.979316
2013-04-05  1553.278930

In [37]:
spx_test.head()

             market_val
date
2013-04-08  1563.071269
2013-04-09  1568.607909
2013-04-10  1587.731827
2013-04-11  1593.369863
2013-04-12  1588.854623